Repository: walsoup/Fichegen
Catalog: src/FicheGen.App/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, fr_fr

# PH_ExportWord.AutomationProperties.Name
source: Export to Word
ar_sa: تصدير Word
fr_fr: Exporter en Word

# PH_ExportPdf.ToolTipService.ToolTip
source: Export to print-ready PDF (Ctrl+Shift+E)
ar_sa: تصدير كمستند PDF عالي الجودة للطباعة (Ctrl+Shift+E)
fr_fr: Exporter en document PDF imprimable (Ctrl+Shift+E)

# PH_ExportPdf.AutomationProperties.Name
source: Export to PDF
ar_sa: تصدير PDF
fr_fr: Exporter en PDF

# PH_PrintButton.ToolTipService.ToolTip
source: Print document (Ctrl+P)
ar_sa: طباعة المستند (Ctrl+P)
fr_fr: Imprimer le document (Ctrl+P)

# PH_PrintButton.AutomationProperties.Name
source: Print document
ar_sa: طباعة المستند
fr_fr: Imprimer le document

# PH_PrintLabel.Text
source: Print
ar_sa: طباعة
fr_fr: Imprimer

# PH_EditButton.ToolTipService.ToolTip
source: Edit document text and instructions
ar_sa: تعديل نصوص وتوجيهات المستند
fr_fr: Modifier le texte et les consignes du document

# PH_EditButton.AutomationProperties.Name
source: Edit document
ar_sa: تعديل المستند
fr_fr: Modifier le document

# PH_EditLabel.Text
source: Edit
ar_sa: تعديل
fr_fr: Modifier

# PH_MoreActions.ToolTipService.ToolTip
source: More actions
ar_sa: خيارات إضافية
fr_fr: Autres actions

# PH_MoreActions.AutomationProperties.Name
source: More export and audio options
ar_sa: المزيد من خيارات التصدير والقراءة
fr_fr: Autres options d'export et d'écoute

# PH_MenuEdit.Text
source: Edit document
ar_sa: تعديل المستند
fr_fr: Modifier le document

# PH_MenuRtf.Text
source: Export to RTF
ar_sa: تصدير RTF
fr_fr: Exporter en RTF

# PH_MenuCopyText.Text
source: Copy full text
ar_sa: نسخ النص بالكامل
fr_fr: Copier le texte complet

# PH_MenuFind.Text
source: Find in document
ar_sa: بحث داخل المستند
fr_fr: Rechercher dans le document

# PH_MenuOpenFolder.Text
source: Open export folder
ar_sa: فتح مجلد التصدير
fr_fr: Ouvrir le dossier d'exportation

# PH_MenuReadAloud.Text
source: Read aloud
ar_sa: قراءة صوتية
fr_fr: Lire à voix haute

# PH_ReadAloudStop
source: ⏹ Stop reading
ar_sa: ⏹ إيقاف القراءة
fr_fr: ⏹ Arrêter la lecture

# PH_ExportBanner.Title
source: Document exported successfully
ar_sa: تم تصدير المستند بنجاح
fr_fr: Document exporté avec succès

# PH_OpenExportedFile.Content
source: Open file
ar_sa: فتح الملف
fr_fr: Ouvrir le fichier

# PH_OpenExportedFile.AutomationProperties.Name
source: Open exported file
ar_sa: فتح الملف المصدر
fr_fr: Ouvrir le fichier exporté

# PH_OpenExportedFolder.Content
source: Open folder
ar_sa: فتح المجلد
fr_fr: Ouvrir le dossier

# PH_OpenExportedFolder.AutomationProperties.Name
source: Open folder in Windows Explorer
ar_sa: فتح المجلد في مستكشف Windows
fr_fr: Ouvrir le dossier dans l'Explorateur Windows

# PH_CopiedToast
source: Full text copied to clipboard
ar_sa: تم نسخ النص بالكامل إلى الحافظة
fr_fr: Texte complet copié dans le presse-papiers

# PH_StreamingBanner.AutomationProperties.Name
source: Streaming document rendering in progress
ar_sa: جارٍ توليد وعرض المستند تدريجياً
fr_fr: Rendu progressif du document en cours

# PH_EmptyState.AutomationProperties.Name
source: No document generated
ar_sa: لا يوجد مستند معروض
fr_fr: Aucun document généré

# PH_EmptyTitle.Text
source: Generate your first document
ar_sa: لا يوجد مستند قيد المعاينة حاليًا
fr_fr: Générez votre première fiche

# PH_EmptyBody.Text
source: Describe your lesson goals, adjust settings, and click « Generate ». The interactive preview will appear here.
ar_sa: حدد الأهداف والمستوى والمادة ثم اضغط على «توليد». ستظهر المعاينة التفاعلية هنا فوراً.
fr_fr: Décrivez votre besoin, ajustez les paramètres, puis cliquez sur « Générer ». L'aperçu interactif de votre fiche apparaîtra ici.

# PH_PaletteButton.AutomationProperties.Name
source: Explore commands (Ctrl+K)
ar_sa: استكشاف الأوامر (Ctrl+K)
fr_fr: Explorer les commandes (Ctrl+K)

# PH_PaletteButton.ToolTipService.ToolTip
source: Opens the command palette
ar_sa: فتح لوحة الأوامر السريعة
fr_fr: Ouvre la palette de commandes

# PH_PaletteLabel.Text
source: What can I do?
ar_sa: لوحة الألوان المخصصة
fr_fr: Que puis-je faire ?

# PH_HistoryButton.AutomationProperties.Name
source: Open my documents
ar_sa: فتح مستنداتي
fr_fr: Ouvrir mes documents

# PH_HistoryLabel.Text
source: My Documents
ar_sa: مستنداتي
fr_fr: Mes documents

# PH_TipsTitle.Text
source: Quick Tips
ar_sa: نصائح سريعة
fr_fr: Astuces rapides

# PH_Tip1.Text
source: Specify grade level and clear objectives for highly tailored content.
ar_sa: حدد المستوى الدراسي والأهداف بوضوح للحصول على محتوى ملائم ودقيق.
fr_fr: Précisez le niveau (ex. : CM2) et l'objectif pédagogique pour un résultat plus ciblé.

# PH_Tip2.Text
source: After generation, ask the AI assistant in the side panel for targeted revisions.
ar_sa: بعد التوليد، يمكنك تعديل المستند أو تصديره مباشرة من الشريط العلوي.
fr_fr: Après la génération, demandez des ajustements à l'assistant IA dans le panneau latéral.

# PH_Tip3.Text
source: Shortcuts: Ctrl+G generates • Ctrl+P prints • Ctrl+Shift+E exports PDF.
ar_sa: اختصارات مفيدة: Ctrl+G للتوليد • Ctrl+P للطباعة • Ctrl+Shift+E لتصدير PDF.
fr_fr: Raccourcis : Ctrl+G génère • Ctrl+P imprime • Ctrl+Shift+E exporte en PDF.

# PH_Skeleton.AutomationProperties.Name
source: Generating document…
ar_sa: جارٍ توليد المستند…
fr_fr: Génération du document en cours

# PH_WebView.AutomationProperties.Name
source: Interactive WebView2 document preview
ar_sa: معاينة تفاعلية عبر WebView2
fr_fr: Aperçu interactif du document WebView2

# PH_ErrorPanel.AutomationProperties.Name
source: Preview unavailable: missing component
ar_sa: المعاينة غير متاحة: المكون مفقود
fr_fr: Aperçu indisponible : composant manquant

# PH_ErrorTitle.Text
source: Preview cannot be displayed
ar_sa: تعذر عرض المعاينة
fr_fr: L'aperçu ne peut pas s'afficher

# PH_ErrorBody.Text
source: PROFstudio requires Microsoft Edge WebView2 to display and export documents. It is not installed on this PC.
ar_sa: يتطلب التطبيق تثبيت Microsoft Edge WebView2 لعرض المستندات وتصديرها.
fr_fr: PROFstudio a besoin du composant Microsoft Edge WebView2 pour afficher et exporter vos documents. Il n'est pas installé sur cet ordinateur.

# PH_InstallButton.Content
source: Install component ↗
ar_sa: تثبيت المكون ↗
fr_fr: Installer le composant ↗

# PH_InstallButton.AutomationProperties.Name
source: Install WebView2 component
ar_sa: تثبيت مكون WebView2
fr_fr: Installer le composant WebView2

# PH_CopyLinkButton.Content
source: Copy link for IT administrator
ar_sa: نسخ الرابط لمسؤول النظام
fr_fr: Copier le lien pour l'informaticien

# PH_CopyLinkButton.AutomationProperties.Name
source: Copy download link for administrator
ar_sa: نسخ رابط التنزيل
fr_fr: Copier le lien de téléchargement pour l'administrateur

# PH_LinkCopied.Text
source: Link copied to clipboard
ar_sa: تم نسخ الرابط إلى الحافظة
fr_fr: Lien copié dans le presse-papiers

# Preview_Generating
source: Generating your document with AI…
ar_sa: جارٍ كتابة المستند بواسطة الذكاء الاصطناعي…
fr_fr: Génération de votre document par l'IA…

# Preview_StatusDefault
source: Preparing preview…
ar_sa: جارٍ تجهيز المعاينة…
fr_fr: Préparation de l'aperçu…

# AP_Title.Text
source: AI Assistant
ar_sa: المساعد الذكي
fr_fr: Assistant IA

# AP_NewConversation.ToolTipService.ToolTip
source: Start a new conversation
ar_sa: بدء محادثة جديدة
fr_fr: Démarrer une nouvelle conversation

# AP_NewConversation.AutomationProperties.Name
source: New conversation
ar_sa: محادثة جديدة
fr_fr: Nouvelle conversation

# AP_NewLabel.Text
source: New
ar_sa: جديد
fr_fr: Nouveau

# AP_ModeSegmented.AutomationProperties.Name
source: Assistant mode
ar_sa: نمط المساعد
fr_fr: Mode de l'assistant

# AP_ModeAuto.Content
source: Auto
ar_sa: تلقائي

# AP_ModeGenerate.Content
source: Generate
ar_sa: توليد
fr_fr: Générer

# AP_ModeEdit.Content
source: Edit
ar_sa: تعديل
fr_fr: Modifier

# AP_ModeQuestion.Content
source: Question
ar_sa: سؤال

# AP_DiffHeader.Text
source: Proposed Revision
ar_sa: اقتراح التعديل
fr_fr: Proposition d'ajustement

# AP_ApplyButton.ToolTipService.ToolTip
source: Apply this revision to the document (undoable with Ctrl+Z)
ar_sa: تطبيق هذا التعديل على المستند (يمكن التراجع بـ Ctrl+Z)
fr_fr: Appliquer cette révision au document (annulation possible avec Ctrl+Z)

# AP_ApplyButton.AutomationProperties.Name
source: Apply revision
ar_sa: تطبيق التعديل
fr_fr: Appliquer la révision

# AP_ApplyLabel.Text
source: Apply revision
ar_sa: تطبيق التعديل
fr_fr: Appliquer la révision

# AP_RejectButton.ToolTipService.ToolTip
source: Ignore this proposal
ar_sa: تجاهل هذا الاقتراح
fr_fr: Ignorer cette proposition

# AP_RejectButton.AutomationProperties.Name
source: Ignore proposal
ar_sa: تجاهل الاقتراح
fr_fr: Ignorer la proposition

# AP_IgnoreLabel.Text
source: Ignore
ar_sa: تجاهل
fr_fr: Ignorer

# AP_CopyButton.ToolTipService.ToolTip
source: Copy text
ar_sa: نسخ النص
fr_fr: Copier le texte

# AP_CopyButton.AutomationProperties.Name
source: Copy text
ar_sa: نسخ النص
fr_fr: Copier le texte

# AP_CopyLabel.Text
source: Copy
ar_sa: نسخ
fr_fr: Copier

# AP_UndoableNote.Text
source: Undoable (Ctrl+Z)
ar_sa: قابل للتراجع (Ctrl+Z)
fr_fr: Annulable (Ctrl+Z)

# AP_Typing.Text
source: Assistant is writing…
ar_sa: المساعد يكتب الآن…
fr_fr: L'assistant rédige…

# AP_SuggestionsLabel.Text
source: Suggestions:
ar_sa: اقتراحات سريعة:

# AP_Chip1.AutomationProperties.Name
source: Suggestion: simplify vocabulary
ar_sa: اقتراح: تبسيط المفردات
fr_fr: Suggestion : simplifier le vocabulaire

# AP_Chip1Label.Text
source: Simplify vocabulary
ar_sa: تبسيط المفردات
fr_fr: Simplifier le vocabulaire

# AP_Chip2.AutomationProperties.Name
source: Suggestion: add three comprehension questions
ar_sa: اقتراح: إضافة 3 أسئلة فهم
fr_fr: Suggestion : ajouter trois questions de compréhension

# AP_Chip2Label.Text
source: Add 3 comprehension questions
ar_sa: إضافة 3 أسئلة للفهم
fr_fr: Ajouter 3 questions de compréhension

# AP_Chip3.AutomationProperties.Name
source: Suggestion: translate to French
ar_sa: اقتراح: الترجمة إلى الإنجليزية
fr_fr: Suggestion : traduire en anglais

# AP_Chip3Label.Text
source: Translate to French
ar_sa: الترجمة إلى الإنجليزية
fr_fr: Traduire en anglais

# AP_Chip4.AutomationProperties.Name
source: Suggestion: summarize in five points
ar_sa: اقتراح: تلخيص في 5 نقاط
fr_fr: Suggestion : résumer en cinq points

# AP_Chip4Label.Text
source: Summarize in 5 points
ar_sa: تلخيص في 5 نقاط
fr_fr: Résumer en 5 points

# AP_Chip5.AutomationProperties.Name
source: Suggestion: differentiate activity
ar_sa: اقتراح: مراعاة الفروق الفردية
fr_fr: Suggestion : différencier l'activité

# AP_Chip5Label.Text
source: Differentiate activity
ar_sa: أنشطة تمايز بيداغوجي
fr_fr: Différencier l'activité

# AP_PromptBox.PlaceholderText
source: Ask for an edit or ask a question…
ar_sa: اطلب تعديلاً أو اطرح سؤالاً بيداغوجياً…
fr_fr: Demandez une modification ou posez une question…

# AP_PromptBox.AutomationProperties.Name
source: Message for assistant
ar_sa: رسالة للمساعد
fr_fr: Message pour l'assistant

# AP_SendButton.ToolTipService.ToolTip
source: Send (Enter)
ar_sa: إرسال (Enter)
fr_fr: Envoyer (Entrée)

# AP_SendButton.AutomationProperties.Name
source: Send message
ar_sa: إرسال الرسالة
fr_fr: Envoyer le message

# AP_StopButton.ToolTipService.ToolTip
source: Stop response
ar_sa: إيقاف الرد
fr_fr: Arrêter la réponse

# AP_StopButton.AutomationProperties.Name
source: Stop response
ar_sa: إيقاف الرد
fr_fr: Arrêter la réponse

# AP_ModelBadge.Text
source: Automatic model
ar_sa: نموذج تلقائي
fr_fr: Modèle automatique

# AP_KeyHints.Text
source: Enter: send • Shift+Enter: new line
ar_sa: Enter: إرسال • Shift+Enter: سطر جديد
fr_fr: Entrée : envoyer • Maj+Entrée : nouvelle ligne

# AP_ModeGenerate_Caption
source: Creates a new document based on your prompt.
ar_sa: ينشئ جذاذة جديدة كلياً بناءً على طلبك.
fr_fr: Crée une nouvelle fiche à partir de votre demande.

# AP_ModeGenerate_Prompt
source: Describe the document to generate…
ar_sa: صف محتوى الوثيقة المراد توليدها…
fr_fr: Décrivez la fiche pédagogique à générer…

# AP_ModeEdit_Caption
source: Suggests targeted revisions for the active document.
ar_sa: يقترح تعديلات دقيقة ومستهدفة على المستند الحالي.
fr_fr: Propose des modifications ciblées sur le document courant.

# AP_ModeEdit_Prompt
source: Describe changes to make to the document…
ar_sa: صف التعديلات المطلوبة على المستند…
fr_fr: Décrivez les changements à apporter au document…

# AP_ModeQuestion_Caption
source: Answers questions without altering the document.
ar_sa: يجيب عن الاستفسارات التعليمية دون تعديل المستند.
fr_fr: Répond à une question sans modifier automatiquement le document.

# AP_ModeQuestion_Prompt
source: Ask a pedagogical question…
ar_sa: اطرح سؤالاً تعليمياً أو تربوياً…
fr_fr: Posez une question pédagogique…

# AP_ModeAuto_Caption
source: Automatically detects whether to generate, edit, or answer.
ar_sa: يتكيف المساعد تلقائيًا مع سياق عملك الحالي.
fr_fr: Détecte automatiquement s'il faut générer, modifier ou répondre.

# PDZ_Zone.AutomationProperties.Name
source: Textbook guide PDF selection area
ar_sa: منطقة اختيار دليل الأستاذ أو الكتاب المدرسي PDF
fr_fr: Zone de sélection du guide pédagogique PDF

# PDZ_Zone.AutomationProperties.HelpText
source: Drag and drop a PDF guide or click to browse
ar_sa: اسحب وأفلت دليل PDF أو انقر لاختياره
fr_fr: Glissez-déposez un guide PDF ou cliquez pour en sélectionner un

# PDZ_EmptyPrimary.Text
source: Drag a PDF guide or click to browse
ar_sa: اسحب دليل PDF أو انقر للتصفح
fr_fr: Glisser un guide PDF ou cliquer pour parcourir

# PDZ_EmptySecondary.Text
source: Textbook, curriculum progression, etc. (optional)
ar_sa: اسحب ملف دليل الأستاذ هنا أو اضغط للاختيار (اختياري)
fr_fr: Manuel scolaire, progression de cycle, etc. (optionnel)

# PDZ_DragOver.Text
source: Drop PDF file here
ar_sa: أفلت ملف PDF هنا
fr_fr: Déposez le fichier PDF ici

# PDZ_FileMeta.Text
source: PDF guide ready for pedagogical grounding
ar_sa: دليل PDF جاهز للاستناد البيداغوجي
fr_fr: Guide PDF prêt pour l'ancrage pédagogique

# PDZ_MetaMb
source: {0:F1} MB · Ready for pedagogical grounding
ar_sa: {0:F1} ميغابايت · جاهز للتحليل التربوي
fr_fr: {0:F1} Mo · Prêt pour l'ancrage pédagogique

# PDZ_MetaKb
source: {0} KB · Ready for pedagogical grounding
ar_sa: {0} كيلوبايت · جاهز للاستناد البيداغوجي
fr_fr: {0} Ko · Prêt pour l'ancrage pédagogique

# PDZ_FileSelected
source: PDF guide selected
ar_sa: تم تحديد دليل PDF
fr_fr: Guide PDF sélectionné

# PDZ_RemoveFile.ToolTipService.ToolTip
source: Remove this guide
ar_sa: إزالة هذا الدليل
fr_fr: Retirer ce guide

# PDZ_RemoveFile.AutomationProperties.Name
source: Remove PDF file
ar_sa: إزالة ملف PDF
fr_fr: Retirer le fichier PDF

# PDZ_ErrorTitle.Text
source: Unsupported format
ar_sa: صيغة غير مدعومة
fr_fr: Format non supporté

# PDZ_ErrorMessage.Text
source: Only .pdf files are supported.
ar_sa: يتم قبول ملفات .pdf فقط.
fr_fr: Seuls les fichiers .pdf sont acceptés.

# PDZ_ErrorPdfOnly
source: Only PDF files (.pdf) are accepted for guides.
ar_sa: يتم قبول ملفات PDF (.pdf) فقط للدلائل البيداغوجية.
fr_fr: Seuls les fichiers PDF (.pdf) sont acceptés pour les guides.

# PDZ_ErrorReadTitle
source: Unable to read file
ar_sa: تعذرت القراءة
fr_fr: Lecture impossible

# PDZ_ErrorReadMessage
source: The file could not be read. Please ensure it is not locked.
ar_sa: تعذر فتح الملف. تأكد من أنه غير مفتوح أو مقفل في برنامج آخر.
fr_fr: Le fichier n'a pas pu être lu. Vérifiez qu'il n'est pas verrouillé.

# PDZ_ErrorClose.ToolTipService.ToolTip
source: Close
ar_sa: إغلاق
fr_fr: Fermer

# PDZ_ErrorClose.AutomationProperties.Name
source: Dismiss error
ar_sa: إغلاق الخطأ
fr_fr: Fermer l'erreur

# PDZ_Processing.Text
source: Analyzing PDF guide…
ar_sa: جارٍ تحليل دليل PDF…
fr_fr: Analyse du guide PDF en cours…

# CW_Splitter.AutomationProperties.Name
source: Resize panels
ar_sa: تغيير حجم اللوحات
fr_fr: Redimensionner les panneaux

# CW_Fab.AutomationProperties.Name
source: Open pedagogical assistant
ar_sa: فتح المساعد التربوي
fr_fr: Ouvrir l'assistant pédagogique

# CW_Fab.ToolTipService.ToolTip
source: Ask a question to the AI assistant
ar_sa: طرح سؤال على المساعد الذكي
fr_fr: Poser une question à l'assistant IA

# CW_FabLabel.Text
source: Assistant
ar_sa: المساعد

# CW_OverlayTitle.Text
source: Pedagogical Assistant
ar_sa: المساعد التربوي
fr_fr: Assistant pédagogique

# CW_CloseOverlay.AutomationProperties.Name
source: Close assistant
ar_sa: إغلاق المساعد
fr_fr: Fermer l'assistant

# CW_CloseOverlay.ToolTipService.ToolTip
source: Close
ar_sa: إغلاق
fr_fr: Fermer

# FP_Title.Text
source: New Lesson Plan
ar_sa: جذاذة بيداغوجية جديدة
fr_fr: Nouvelle fiche pédagogique

# FP_Subtitle.Text
source: Prepare a structured session, ready to print or export.
ar_sa: أعدّ خطة درس محكمة وجاهزة للطباعة والتصدير.
fr_fr: Préparez une séance structurée, prête à imprimer ou exporter.

# EP_Title.Text
source: New Evaluation
ar_sa: تقويم / امتحان جديد
fr_fr: Nouvelle évaluation

# EP_Subtitle.Text
source: Create a test with progressive exercises and grading rubrics.
ar_sa: أنشئ فرضاً مع تمارين متدرجة وسلم تنقيط مفصل.
fr_fr: Créez un contrôle avec exercices progressifs et barème de correction.

# QP_Title.Text
source: New Quiz
ar_sa: اختبار سريع جديد
fr_fr: Nouveau quiz

# QP_Subtitle.Text
source: Generate a printable questionnaire with its detailed answer key.
ar_sa: ولّد استبياناً واختباراً قابلاً للطباعة مع عناصر الإجابة.
fr_fr: Générez un questionnaire imprimable avec son corrigé détaillé.

# FP_AssistantToggle.ToolTipService.ToolTip
source: Show or hide side AI assistant
ar_sa: إظهار أو إخفاء المساعد الجانبي
fr_fr: Afficher ou masquer l'assistant IA latéral

# EP_AssistantToggle.ToolTipService.ToolTip
source: Show or hide side AI assistant
ar_sa: إظهار أو إخفاء المساعد الجانبي
fr_fr: Afficher ou masquer l'assistant IA latéral

# QP_AssistantToggle.ToolTipService.ToolTip
source: Show or hide side AI assistant
ar_sa: إظهار أو إخفاء المساعد الجانبي
fr_fr: Afficher ou masquer l'assistant IA latéral

# FP_AssistantLabel.Text
source: Assistant
ar_sa: المساعد

# EP_AssistantLabel.Text
source: Assistant
ar_sa: المساعد

# QP_AssistantLabel.Text
source: Assistant
ar_sa: المساعد

# Validation_Title
source: Almost ready!
ar_sa: أوشكنا على الانتهاء!
fr_fr: Presque prêt !

# Validation_MissingLevel
source: the grade level
ar_sa: المستوى الدراسي
fr_fr: le niveau

# Validation_MissingSubject
source: the subject
ar_sa: المادة التعليمية
fr_fr: la matière

# Validation_MissingTopic
source: the lesson topic
ar_sa: عنوان أو موضوع الدرس
fr_fr: le sujet de la leçon

# Validation_MissingTopics
source: at least one concept to evaluate
ar_sa: مفهوم واحد على الأقل للتقويم
fr_fr: au moins une notion à évaluer

# FP_MissingFields_Message
source: To generate the lesson plan, please provide: {0}.
ar_sa: يرجى ملء الحقول المطلوبة: {0}.
fr_fr: Pour générer la fiche, indiquez encore : {0}.

# EP_MissingFields_Message
source: To generate the evaluation, please provide: {0}.
ar_sa: يرجى ملء الحقول المطلوبة: {0}.
fr_fr: Pour générer l'évaluation, indiquez encore : {0}.

# QP_MissingFields_Message
source: To generate your quiz, please provide: {0}.
ar_sa: يرجى ملء الحقول المطلوبة: {0}.
fr_fr: Pour générer votre quiz, indiquez encore : {0}.

# HP_Title.Text
source: My Documents
ar_sa: مستنداتي
fr_fr: Mes documents

# HP_Subtitle.Text
source: Browse all lesson plans, evaluations, and quizzes saved locally on this PC.
ar_sa: استعرض كل الجذاذات والفروض والاختبارات المحفوظة محلياً على جهازك.
fr_fr: Retrouvez toutes vos fiches, évaluations et quiz sauvegardés automatiquement sur cet ordinateur.

# HP_SearchBox.PlaceholderText
source: Search by title, subject, level, or keyword…
ar_sa: بحث بالمستوى، المادة، الموضوع أو الكلمات المفتاحية…
fr_fr: Rechercher par titre, matière, niveau ou mot-clé…

# HP_FilterAll.Content
source: All
ar_sa: الكل
fr_fr: Tout

# HP_FilterFiches.Content
source: Lesson Plans
ar_sa: الجذاذات
fr_fr: Fiches

# HP_FilterEvals.Content
source: Evaluations
ar_sa: التقويمات
fr_fr: Évaluations

# HP_FilterQuiz.Content
source: Quizzes
ar_sa: الاختبارات
fr_fr: Quiz

# HP_FilterFavorites.Content
source: Favorites
ar_sa: المفضلة
fr_fr: Favoris

# HP_EmptyState.AutomationProperties.Name
source: No documents in library
ar_sa: المكتبة فارغة
fr_fr: Aucun document dans la bibliothèque

# HP_Tip1.Text
source: Every generated lesson plan, evaluation, or quiz is automatically saved here.
ar_sa: يتم حفظ كل جذاذة أو تقويم أو اختبار يتم توليده تلقائياً هنا.
fr_fr: Chaque fiche, évaluation ou quiz généré est sauvegardé automatiquement ici.

# HP_Tip2.Text
source: Use search to quickly find documents by subject, grade level, or keyword.
ar_sa: استخدم البحث للوصول السريع إلى أي مستند بحسب المادة أو المستوى.
fr_fr: Utilisez la recherche pour retrouver rapidement un document par matière, niveau ou mot-clé.

# HP_OptionsButton.ToolTipService.ToolTip
source: Document options (⋯)
ar_sa: خيارات المستند (⋯)
fr_fr: Options du document (⋯)

# HP_OptionsButton.AutomationProperties.Name
source: Document options
ar_sa: خيارات المستند
fr_fr: Options du document

# HP_MenuOpen.Text
source: Open document
ar_sa: فتح المستند
fr_fr: Ouvrir le document

# HP_MenuRename.Text
source: Rename
ar_sa: إعادة تسمية
fr_fr: Renommer

# HP_RenameTitle
source: Rename document
ar_sa: إعادة تسمية المستند
fr_fr: Renommer le document

# HP_RenameConfirm
source: Rename
ar_sa: إعادة تسمية
fr_fr: Renommer

# HP_MenuExportWord.Text
source: Export to Word (.docx)
ar_sa: تصدير Word (.docx)
fr_fr: Exporter en Word (.docx)

# HP_MenuExportPdf.Text
source: Export to PDF
ar_sa: تصدير PDF
fr_fr: Exporter en PDF

# HP_MenuDelete.Text
source: Delete document
ar_sa: حذف المستند
fr_fr: Supprimer le document

# HP_UndoToastDefault.Text
source: Document deleted
ar_sa: تم حذف المستند
fr_fr: Document supprimé

# HP_UndoToast
source: « {0} » deleted.
ar_sa: تم حذف « {0} ».
fr_fr: « {0} » supprimé.

# HP_UndoButton.Content
source: Undo
ar_sa: تراجع
fr_fr: Annuler

# HP_DeleteTitle
source: Delete this document?
ar_sa: هل أنت متأكد من حذف هذا المستند؟
fr_fr: Supprimer ce document ?

# HP_DeleteContent
source: « {0} » will be removed from your saved documents.
ar_sa: سيتم حذف « {0} » نهائياً من مستنداتك المحفوظة.
fr_fr: « {0} » sera retiré de vos documents.

# HP_DeleteConfirm
source: Delete
ar_sa: حذف
fr_fr: Supprimer

# SP_Title.Text
source: Settings
ar_sa: الإعدادات
fr_fr: Paramètres

# SP_Subtitle.Text
source: Configure PROFstudio: appearance, artificial intelligence, document styles, and privacy.
ar_sa: إعدادات PROFstudio: السمات، مفاتيح الذكاء الاصطناعي، مجلدات الحفظ والتخصيص.
fr_fr: Configurez PROFstudio : apparence, intelligence artificielle, styles de documents et confidentialité.

# SP_TabGeneral.Text
source: General
ar_sa: عام
fr_fr: Général

# SP_TabAi.Text
source: AI & Routing
ar_sa: الذكاء الاصطناعي
fr_fr: IA & Routage

# SP_TabFolders.Text
source: Folders
ar_sa: المجلدات
fr_fr: Dossiers

# SP_TabStyles.Text
source: Styles
ar_sa: الأنماط والتنسيق

# SP_TabPrivacy.Text
source: Privacy
ar_sa: الخصوصية
fr_fr: Confidentialité

# SP_TabPrompts.Text
source: Prompts & Shortcuts
ar_sa: القوالب والاختصارات
fr_fr: Prompts & Raccourcis

# SP_SaveButton.ToolTipService.ToolTip
source: Save (Ctrl+S)
ar_sa: حفظ (Ctrl+S)
fr_fr: Enregistrer (Ctrl+S)

# SP_SaveLabel.Text
source: Save Settings
ar_sa: حفظ الإعدادات
fr_fr: Enregistrer les paramètres

# FRD_Dialog.Title
source: Welcome to PROFstudio
ar_sa: مرحباً بك في PROFstudio
fr_fr: Bienvenue dans PROFstudio

# FRD_Dialog.PrimaryButtonText
source: Get Started
ar_sa: ابدأ الآن
fr_fr: Commencer

# FRD_Dialog.CloseButtonText
source: Skip for now
ar_sa: تخطي حالياً
fr_fr: Passer pour l'instant

# FRD_StepIndicator.Text
source: Step 1 of 3
ar_sa: الخطوة 1 من 3
fr_fr: Étape 1 sur 3

# FRD_StepFormat
source: Step {0} of {1}
ar_sa: الخطوة {0} من {1}
fr_fr: Étape {0} sur {1}

# FRD_HeroTitle.Text
source: Your Lesson Preparation Assistant
ar_sa: مساعدك الذكي لإعداد الدروس والوثائق
fr_fr: Votre assistant de préparation
